import os
from langchain_community.vectorstores import Chroma
from langchain_community.embeddings import OpenAIEmbeddings
from langchain_core.documents import Document
from dotenv import dotenv_values
config = dotenv_values(".env")

os.environ["OPENAI_API_KEY"] = config["openai_api"]

context_data = "./doc_Data/context"

contextual_vector = Chroma(persist_directory=context_data, embedding_function=OpenAIEmbeddings(), collection_name=f"cdti_doc")


document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของ โครงสร้างพื้นฐานการคำนวณ
    - 312-3303  โครงสร้างพื้นฐานการคำนวณ 3(3-0-6) (Computing Infrastructure) วิชาบังคับก่อน : 310-2206 ระบบปฏิบัติการ 

    # วิชาบังคับก่อนหน้าของ ปฏิบัติการโครงสร้างพื้นฐานการคำนวณ
    - 312-3304  ปฏิบัติการโครงสร้างพื้นฐานการคำนวณ 1(0-3-2) (Computing Infrastructure Laboratory) 
    - วิชาบังคับก่อน : 312-3303 โครงสร้างพื้นฐานการคำนวณ หรือเรียนร่วมกัน ปฏิบัติการต่าง ๆ มีเนื้อหาสอดคล้องและสนับสนุนทฤษฎีในรายวิชา 312-3303 โครงสร้างพื้นฐาน   การคำนวณ

    # วิชาบังคับก่อนหน้าของ การสืบเสาะความรู้และการทำเหมืองข้อมูล
    - 312-3305  การสืบเสาะความรู้และการทำเหมืองข้อมูล  3(3-0-6) (Knowledge Discovery and Data Mining) 
    - วิชาบังคับก่อน : 312-3302 ปัญญาประดิษฐ์ หรือเรียนร่วมกันการทำเหมืองข้อมูล กระบวนการสืบเสาะความรู้ การประมวลผลข้อมูลก่อน คลังข้อมูล การวิเคราะห์ ความสัมพันธ์ การจำแนก การแบ่งกลุ่ม การถดถอย การประเมินค่าของความรู้ การสร้างมโนภาพ การประยุกต์ใช้ การทำเหมืองข้อมูล
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_1"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_1"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของ การวิเคราะห์ธุรกิจ/สถิติ
    - 312-3406  การวิเคราะห์ธุรกิจ/สถิติ  3(3-0-6) (Business Analytics/Statistics) 
    - วิชาบังคับก่อน : ไม่มี 
    
    # วิชาบังคับก่อนหน้าของ การสื่อสารดิจิทัลและการประมวลสัญญาณ
    - 310-3307  การสื่อสารดิจิทัลและการประมวลสัญญาณ  3(3-0-6) (Digital Communication and Signal Processing) 
    - วิชาบังคับก่อน : 300-1208 วิยุตคณิต 

    # วิชาบังคับก่อนหน้าของ วิธีเชิงตัวเลข
    - 310-3308  วิธีเชิงตัวเลข 3(3-0-6) (Numerical Methods) 
    - วิชาบังคับก่อน : 300-1107 พื้นฐานการเขียนโปรแกรม 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_2"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_2"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการคํานวณแบบกระจาย
    - 310-3309 การคํานวณแบบกระจาย 3(3-0-6) (Distributed Computing) 
    - วิชาบังคับก่อน : 310-2202 โครงสร้างของระบบคอมพิวเตอร์ 

    # วิชาบังคับก่อนหน้าของเทคโนโลยีสำหรับบ้านเมืองอัจฉริยะ
    - 310-3310  เทคโนโลยีสำหรับบ้านเมืองอัจฉริยะ  3(3-0-6) (Enabling Technologies for Smart Cities and Homes) 
    - วิชาบังคับก่อน : 310-2309  ระบบฐานข้อมูล 

    # วิชาบังคับก่อนหน้าของการประมวลผลภาพ
    - 310-3311  การประมวลผลภาพ  3(3-0-6) (Image Processing) 
    - วิชาบังคับก่อน : 300-1208 วิยุตคณิต 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_3"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_3"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของหัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 1
    - 310-3312  หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 1  3(3-0-6) (Selected Topics in Computer Engineering I) 
    - วิชาบังคับก่อน : โดยความเห็นชอบของคณะ องค์ความรู้ใหม่ เรื่องที่น่าสนใจและเป็นประเด็นสำคัญ ด้านวิศวกรรมคอมพิวเตอร์

    # วิชาบังคับก่อนหน้าของหัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 2 
    - 310-3313  หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 2  3(3-0-6) (Selected Topics in Computer Engineering II) 
    - วิชาบังคับก่อน : โดยความเห็นชอบของคณะ องค์ความรู้ใหม่ เรื่องที่น่าสนใจและเป็นประเด็นสำคัญ ด้านวิศวกรรมคอมพิวเตอร์
    
    # วิชาบังคับก่อนหน้าของหัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 3
    - 310-3414  หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 3  3(3-0-6) (Selected Topics in Computer Engineering III) 
    - วิชาบังคับก่อน : โดยความเห็นชอบของคณะ องค์ความรู้ใหม่ เรื่องที่น่าสนใจและเป็นประเด็นสำคัญ ด้านวิศวกรรมคอมพิวเตอร์
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_4"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_4"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของ หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 4
    - 310-3415  หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 4  3(3-0-6) (Selected Topics in Computer Engineering IV) 
    - วิชาบังคับก่อน : โดยความเห็นชอบของคณะ องค์ความรู้ใหม่ เรื่องที่น่าสนใจและเป็นประเด็นสำคัญ ด้านวิศวกรรมคอมพิวเตอร์

    # วิชาบังคับก่อนหน้าของ การวิเคราะห์และการออกแบบขั้นตอนวิธี
    - 310-3416  การวิเคราะห์และการออกแบบขั้นตอนวิธี 3(3-0-6) (Analysis and Design of Algorithms) 
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี 

    # วิชาบังคับก่อนหน้าของ หัวข้อคัดสรรด้านวิศวกรรมคอมพิวเตอร์ 4 
    - 310-3417  การทดสอบและประกันคุณภาพซอฟต์แวร์  3(3-0-6) (Software Testing and Quality Assurance) 
    - วิชาบังคับก่อน : 310-2205 วิศวกรรมซอฟต์แวร์ 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_5"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_5"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการคำนวณประสิทธิภาพสูง
    - 310-3418  การคำนวณประสิทธิภาพสูง  3(3-0-6) (High Performance Computing) 
    - วิชาบังคับก่อน : 310-2202 โครงสร้างของระบบคอมพิวเตอร์ 

    # วิชาบังคับก่อนหน้าของการดูแลบริหารจัดการข้อมูล
    - 310-3419  การดูแลบริหารจัดการข้อมูล  3(3-0-6) (Data Curation, Management, and Organization)  
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี 

    # วิชาบังคับก่อนหน้าของการพัฒนาและให้บริการระบบเว็บ
    - 310-3420  การพัฒนาและให้บริการระบบเว็บ  3(3-0-6) (Web Development and Operations) 
    - วิชาบังคับก่อน : 310-2309 ระบบฐานข้อมูล 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_6"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_6"])


document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของธุรกิจและการเป็นผู้ประกอบการ
    - 310-3421  ธุรกิจและการเป็นผู้ประกอบการ 3(3-0-6) (Business and Entrepreneurship)  
    - วิชาบังคับก่อน : ไม่มี 

    # วิชาบังคับก่อนหน้าของระบบฐานข้อมูล
    - 310-2309 ระบบฐานข้อมูล 3(3-0-6) (Database Systems)  
    - วิชาบังคับก่อน : ไม่มี  

    # วิชาบังคับก่อนหน้าของการพัฒนาโปรแกรมแบบอะซิโครนัส
    - 310-2310 การพัฒนาโปรแกรมแบบอะซิโครนัส 3(3-0-6) (Asynchronous Programing Development)  
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี  
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_7"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_7"])



document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของ การคำนวณแบบกลุ่มเมฆ
    - 310-2311 การคำนวณแบบกลุ่มเมฆ 3(3-0-6) (Cloud Computing)  
    - วิชาบังคับก่อน : 310-2202 โครงสร้างของระบบคอมพิวเตอร์  

    # วิชาบังคับก่อนหน้าของ ฝึกงานวิศวกรรมคอมพิวเตอร์
    - 310-2312 ฝึกงานวิศวกรรมคอมพิวเตอร์ 0(200 ชั่วโมง) (Computer Engineering Internship)  
    - วิชาบังคับก่อน : ไม่มี  

    # วิชาบังคับก่อนหน้าของ อินเทอร์เน็ตของสรรพสิ่ง
    - 310-2413 อินเทอร์เน็ตของสรรพสิ่ง 3(3-0-6) (Internet of Things)  
    - วิชาบังคับก่อน : 310-2307 เครือข่ายคอมพิวเตอร์ 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_8"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_8"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการเรียนรู้ของเครื่อง
    - 310-2414 การเรียนรู้ของเครื่อง 3(3-0-6) (Machine Learning)  
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี  

    # วิชาบังคับก่อนหน้าของความปลอดภัยของระบบคอมพิวเตอร์และเครือข่าย
    - 310-2415 ความปลอดภัยของระบบคอมพิวเตอร์และเครือข่าย 3(3-0-6) (Computer Systems and Network Security)  
    - วิชาบังคับก่อน : 310-2307 เครือข่ายคอมพิวเตอร์  

    # วิชาบังคับก่อนหน้าของความปลอดภัยของโครงงานวิศวกรรมคอมพิวเตอร์ 1
    - 310-2416 โครงงานวิศวกรรมคอมพิวเตอร์ 1 1(0-6-6) (Computer Engineering Project I)  
    - วิชาบังคับก่อน : โดยความเห็นชอบของคณะฯ  
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_9"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_9"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของโครงงานวิศวกรรมคอมพิวเตอร์
    - 310-2417 โครงงานวิศวกรรมคอมพิวเตอร์ 2 3(0-6-6) (Computer Engineering Project II)  
    - วิชาบังคับก่อน : 310-2416 โครงงานวิศวกรรมคอมพิวเตอร์ 1  

    # วิชาบังคับก่อนหน้าของแอนะล็อกและดิจิทัลอิเล็กทรอนิกส์
    - 311-3201  แอนะล็อกและดิจิทัลอิเล็กทรอนิกส์  3(3-0-6) (Analog and Digital Electronics)  
    - วิชาบังคับก่อน : 300-1105 ทฤษฎีวงจรไฟฟ้า 

    # วิชาบังคับก่อนหน้าของสัญญาณและระบบเบื้องต้น
   - 311-3302  สัญญาณและระบบเบื้องต้น  3(3-0-6) (Introduction to Signals and Systems) 
    - วิชาบังคับก่อน : 300-1102 คณิตศาสตร์วิศวกรรม 2 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_10"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_10"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการออกแบบระบบฝังตัว
    - 311-3303  การออกแบบระบบฝังตัว 3(3-0-6) (Embedded System Design) 
    - วิชาบังคับก่อน : 310-2202 โครงสร้างของระบบคอมพิวเตอร์ 

    # วิชาบังคับก่อนหน้าของปฏิบัติการออกแบบระบบฝังตัว 
    - 311-3304  ปฏิบัติการออกแบบระบบฝังตัว 1(0-3-2) (Embedded System Design Laboratory) 
    - วิชาบังคับก่อน : 311-3303 การออกแบบระบบฝังตัว

    # วิชาบังคับก่อนหน้าของการเชื่อมต่อไซเบอร์-กายภาพ 
    - 311-3305  การเชื่อมต่อไซเบอร์-กายภาพ  3(3-0-6) (Cyber-Physical Interfacing) 
    - วิชาบังคับก่อน : 311-3303 การออกแบบระบบฝังตัว 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_11"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_11"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการออกแบบระดับสูงสำหรับระบบดิจิทัล
    - 311-3306  การออกแบบระดับสูงสำหรับระบบดิจิทัล 3(3-0-6) (High Level Design for Digital Systems) 
    - วิชาบังคับก่อน : 300-1209 การออกแบบลอจิกของระบบดิจิทัล  

    # วิชาบังคับก่อนหน้าของวิทยาการข้อมูลเบื้องต้น
    - 312-3201  วิทยาการข้อมูลเบื้องต้น 3(3-0-6) (Introduction to Data Science) 
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี 

    # วิชาบังคับก่อนหน้าของปัญญาประดิษฐ์
     - 312-3302  ปัญญาประดิษฐ์ 3(3-0-6) (Artificial Intelligence) 
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี และ 300-1208 วิยุตคณิต 
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_12"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_12"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของคณิตศาสตร์วิศวกรรม 1
    - 300-1101  คณิตศาสตร์วิศวกรรม 1 3(3-0-6) (Engineering Mathematics I) 
    - วิชาบังคับก่อน : ไม่มี 

    # วิชาบังคับก่อนหน้าของคณิตศาสตร์วิศวกรรม 2 
    - 300-1102 คณิตศาสตร์วิศวกรรม 2 3(3-0-6) (Engineering Mathematics II) 
    - วิชาบังคับก่อน : 300-1101 คณิตศาสตร์วิศวกรรม 1

    # วิชาบังคับก่อนหน้าของฟิสิกส์
   - 300-1103 ฟิสิกส์ 3(3-0-6) (Physics)
    - วิชาบังคับก่อน : ไม่มี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_13"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_13"])


document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของปฏิบัติการฟิสิกส์
    - 300-1104 ปฏิบัติการฟิสิกส์ 1(0-3-2) (Physics Laboratory)
    - วิชาบังคับก่อน : 300-1103 ฟิสิกส์ หรือเรียนร่วมกัน

    # วิชาบังคับก่อนหน้าของทฤษฎีวงจรไฟฟ้า
    - 300-1105 ทฤษฎีวงจรไฟฟ้า 3(3-0-6) (Electric Circuit Theory)
    - วิชาบังคับก่อน : ไม่มี

    # วิชาบังคับก่อนหน้าของปฏิบัติการวงจรไฟฟ้า
    - 300-1106 ปฏิบัติการวงจรไฟฟ้า 1(0-3-2) (Electric Circuit Laboratory)
    - วิชาบังคับก่อน : 300-1105 ทฤษฎีวงจรไฟฟ้า หรือเรียนร่วมกัน
    """,
    metadata={"source": "วิชายังคับก่อนหน้าของแต่ละวิชา_14"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_14"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของพื้นฐานการเขียนโปรแกรม
    - 300-1107 พื้นฐานการเขียนโปรแกรม 3(2-2-6) (Programming Fundamentals)
    - วิชาบังคับก่อน : ไม่มี

    # วิชาบังคับก่อนหน้าของวิยุตคณิต
    - 300-1208 วิยุตคณิต 3(3-0-6) (Discrete Mathematics)
    - วิชาบังคับก่อน : 300-1102 คณิตศาสตร์วิศวกรรม 2

    # วิชาบังคับก่อนหน้าของการออกแบบลอจิกของระบบดิจิทัล
    - 300-1209 การออกแบบลอจิกของระบบดิจิทัล 3(3-0-6) (Logic Design of Digital Systems)
    - วิชาบังคับก่อน : ไม่มี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_15"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_15"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของปฏิบัติการออกแบบระบบดิจิทัล
    - 300-1210 ปฏิบัติการออกแบบระบบดิจิทัล 1(0-3-2) (Digital System Design Laboratory)
    - วิชาบังคับก่อน : 300-1209 การออกแบบลอจิกของระบบดิจิทัล หรือเรียนร่วมกัน

    # วิชาบังคับก่อนหน้าของสถิติคณิตศาสตร์
    - 300-1211 สถิติคณิตศาสตร์ 3(3-0-6) (Mathematical Statistics)
    - วิชาบังคับก่อน : 300-1101 คณิตศาสตร์วิศวกรรม 1

    # วิชาบังคับก่อนหน้าของสัมมนาวิศวกรรมคอมพิวเตอร์
    - 300-1412 สัมมนาวิศวกรรมคอมพิวเตอร์ 1(1-2-2) (Computer Engineering Seminar)
    - วิชาบังคับก่อน : ไม่มี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_16"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_16"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของจริยธรรมวิชาชีพทางด้านคอมพิวเตอร์
    - 300-1413 จริยธรรมวิชาชีพทางด้านคอมพิวเตอร์ 1(3-0-0) (Professional Ethics in Computer Fields)
    - วิชาบังคับก่อน : ไม่มี

    # วิชาบังคับก่อนหน้าของโครงสร้างข้อมูลและขั้นตอนวิธี
    - 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี 3(2-2-6) (Data Structures and Algorithms)
    - วิชาบังคับก่อน : 300-1107 พื้นฐานการเขียนโปรแกรม

    # วิชาบังคับก่อนหน้าของโครงสร้างของระบบคอมพิวเตอร์
   - 310-2202 โครงสร้างของระบบคอมพิวเตอร์ 3(3-0-6) (Computer Organization)
    - วิชาบังคับก่อน : ไม่มี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_17"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_17"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของการพัฒนาระบบซอฟต์แวร์ 1
    - 310-2203 การพัฒนาระบบซอฟต์แวร์ 1 1(0-6-2) (Software Systems Development I)
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี

    # วิชาบังคับก่อนหน้าของการพัฒนาระบบซอฟต์แวร์ 2
    - 310-2204 การพัฒนาระบบซอฟต์แวร์ 2 2(0-6-2) (Software System Development II)
    - วิชาบังคับก่อน : 310-2203 การพัฒนาระบบซอฟต์แวร์ 1

    # วิชาบังคับก่อนหน้าของวิศวกรรมซอฟต์แวร์
   - 310-2205 วิศวกรรมซอฟต์แวร์ 3(3-0-6) (Software Engineering)
    - วิชาบังคับก่อน : ไม่มี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_18"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_18"])

document_1 = Document(
    page_content="""
    # วิชาบังคับก่อนหน้าของระบบปฏิบัติการ
    - 310-2206 ระบบปฏิบัติการ 3(3-0-6) (Operating Systems)
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี

    # วิชาบังคับก่อนหน้าของเครือข่ายคอมพิวเตอร์
    - 310-2307 เครือข่ายคอมพิวเตอร์ 3(3-0-6) (Computer Networks)
    - วิชาบังคับก่อน : ไม่มี

    # วิชาบังคับก่อนหน้าของปฏิสัมพันธ์ระหว่างคอมพิวเตอร์กับมนุษย์
    - 310-2308 ปฏิสัมพันธ์ระหว่างคอมพิวเตอร์กับมนุษย์ 3(3-0-6) (Computer-Human Interactions)
    - วิชาบังคับก่อน : 310-2101 โครงสร้างข้อมูลและขั้นตอนวิธี
    """,
    metadata={"source": "วิชาบังคับก่อนหน้าของแต่ละวิชา_19"},
)
contextual_vector.add_documents(documents=[document_1], ids=["วิชาบังคับก่อนหน้าของแต่ละวิชา_19"])


# for i in range(1, 20):
#     contextual_vector.delete(ids=[f"วิชาบังคับก่อนหน้าของแต่ละวิชา_{i}"])