import os
from langchain_community.vectorstores import Chroma
from langchain_community.embeddings import OpenAIEmbeddings
from langchain_core.documents import Document
from dotenv import dotenv_values
config = dotenv_values(".env")

os.environ["OPENAI_API_KEY"] = config["openai_api"]

context_data = "./doc_Data/context"

contextual_vector = Chroma(persist_directory=context_data, embedding_function=OpenAIEmbeddings(), collection_name=f"cdti_doc")


# document_1 = Document(
#     page_content="""
#     ## บุคลากร คณบดีของคณะเทคโนโลยีดิจิทัล และ อาจารย์ประจำคณะ ของคณะเทคโนโลยีดิจิทัล
#     คณบดีประจำคณะ หรือ `ชื่อของคณบดี`: รองศาสตราจารย์ ดร. วรา วราวิทย์
#     อาจารย์ประจำคณะ หรือ `รายชื่ออาจารย์ประจำคณะเทคโนโลยีดิจิทัล`: 
#     1. รองศาสตราจารย์ ดร. สุมาลี อุณหวณิชย์
#     2. รองศาสตราจารย์ ดร. ธีรศิลป์ ทุมวิภาต
#     3. อาจารย์ ชยันต์ คงทองวัฒนา
#     4. ผู้ช่วยศาสตราจารย์ ภาษิศร์ ณ รังษี
#     5. อาจารย์ กฤษฎา พรหมสุทธิรักษ์
#     6. อาจารย์ ณัฐวดี ศรีคชา
#     7. ดร. ศรายุทธ ฉายสุริยะ
#     8. ผู้ช่วยศาสตราจารย์ ดร. วรัญญู วงษ์เสรี
#     9. ผู้ช่วยศาสตราจารย์ สิริทัต เตชะพะโลกุล
#     10. ผู้ช่วยศาสตราจารย์ ดร. ดำรงค์ฤทธิ์ เศรษฐ์ศิริโชค
#     """,
#     metadata={"source": "รายชื่ออาจารย์ประจำคณะ"},
# )
# contextual_vector.add_documents(documents=[document_1], ids=["รายชื่ออาจารย์ประจำคณะ"])

# document_2 = Document(
#     page_content="""
#     ### คณบดีประจำคณะเทคโนโลยีดิจิทัล
#     คณบดีประจำคณะ หรือ `ชื่อของคณบดี` หรือ คณบดีของคณะเทคโนโลยีดิจิทัล: รองศาสตราจารย์ ดร. วรา วราวิทย์
#     """,
#     metadata={"source": "คณบดีของคณะเทคโนโลยีดิจิทัล"},
# )

# contextual_vector.add_documents(documents=[document_1], ids=["อาจารย์ประจำคณะ"])
# contextual_vector.add_documents(documents=[document_2], ids=["คณบดีของคณะเทคโนโลยีดิจิทัล"])

# document_2 = Document(
#     page_content="""
#     # ค่าเทอมของคณะดิจิทัล
#     ## หลักสูตร 4 ปี
#     ### `ค่าเทอมของคณะ`
#     | สาขาวิชา | ปี 1 |  | ปี 2 |  | ปี 3 |  | ปี 4 |  |
#     |----------|------|------|------|------|------|------|------|------|
#     |          | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 |
#     | สาขาวิศวกรรมคอมพิวเตอร์ | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 |
#     | สาขาการออกแบบดิจิทัลและเทคโนโลยี | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 | 31,500 |
#     """,
#     metadata={"source": "./digital_doc/general/ค่าเทอม.md"},
# )

# document_2 = Document(
#     page_content="""
#     # ค่าเทอมของคณะบริหารธุรกิจ
#     ## หลักสูตร 4 ปี
#     ### ค่าเทอมของคณะบริหารธุรกิจ
#     | สาขาวิชา | ปี 1 |  | ปี 2 |  | ปี 3 |  | ปี 4 |  |
#     |----------|------|------|------|------|------|------|------|------|
#     |          | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 | เทอม 1 | เทอม 2 |
#     | สาขาการจัดการธุรกิจอาหาร | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 |
#     | สาขาการเป็นผู้ประกอบการ | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 | 29,500 |
#     """,
#     metadata={"source": "./digital_doc/general/ค่าเทอม.md"},
# )

document_2 = Document(
    page_content="""
    # ค่าเทอมของคณะดิจิทัล
    ## หลักสูตร 4 ปี
    ### `ค่าเทอมของคณะ`
    1 ปีมีทั้งหมด 2 เทอม
    เทอมละ 31,500 บาท ทั้งสาขาวิศวกรรมคอมพิวเตอร์ และ สาขาการออกแบบดิจิทัลและเทคโนโลยี
    """,
    metadata={"source": "ราคาค่าเทอมของคณะเทคโนโลยีดิจิทัล2"},
)

contextual_vector.add_documents(documents=[document_2], ids=["ราคาค่าเทอมของคณะเทคโนโลยีดิจิทัล2"])

# contextual_vector.delete(ids=["อาจารย์ประจำคณะ"])
# contextual_vector.delete(where={"source": "./digital_doc/general/ค่าเทอม.md"})

# document_1 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 1 เทอม 1
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 1 ภาคการศึกษาที่ 1 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 300-1101 คณิตศาสตร์วิศวกรรม 1  3(3-0-6) 
#     - 300-1103 ฟิสิกส์  3(3-0-6) 
#     - 300-1104 ปฏิบัติการฟิสิกส์  1(0-3-2) 
#     - 300-1107  พื้นฐานการเขียนโปรแกรม 3(2-2-6) 
#     - 920-1135 สุขภาวะกายและจิต 3(3-0-6) 
#     - 931-1107 คณิตศาสตร์และสถิติในชีวิตประจำวัน 3(3-0-6) 
#     - 942-1101 ภาษาอังกฤษปรับพื้นฐาน 1 0(3-0-6) 
#     - 920-11xx วิชาเลือกกลุ่มวิชามนุษยศาสตร์  1(0-3-1) 
#     - รวม 17(17-8-39)
#     """,
#     metadata={"source": "แผนการศึกษาปี 1 เทอม 1"},
# )
# document_2 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 1 เทอม 2
#     -แผนการศึกษา ของคณะและสาขา ปีที่ 1 ภาคการศึกษาที่ 2 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 300-1102  คณิตศาสตร์วิศวกรรม 2  3(3-0-6) 
#     - 300-1105 ทฤษฎีวงจรไฟฟ้า  3(3-0-6) 
#     - 300-1106  ปฏิบัติการวงจรไฟฟ้า 1(0-3-2) 
#     - 310-2101  โครงสร้างข้อมูลและขั้นตอนวิธี 3(2-2-6) 
#     - 932-1107 วิทยาศาสตร์เพื่อคุณภาพชีวิต 3(3-0-6) 
#     - 941-1103 การอ่านและการเขียนภาษาไทยเพื่ออาชีพ  2(1-2-3) 
#     - 942-1102 ภาษาอังกฤษปรับพื้นฐาน 2 0(3-0-6) 
#     - รวม 15(15-7-35)
#     """,
#     metadata={"source": "แผนการศึกษาปี 1 เทอม 2"},
# )
# document_3 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 2 เทอม 1
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 2 ภาคการศึกษาที่ 1 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 300-1208 วิยุตคณิต 3(3-0-6) 
#     - 300-1209 การออกแบบลอจิกของระบบดิจิทัล 3(3-0-6) 
#     - 300-1210 ปฏิบัติการออกแบบระบบดิจิทัล  1(0-3-2) 
#     - 310-2202 โครงสร้างของระบบคอมพิวเตอร์  3(3-0-6)  
#     - 310-2203  การพัฒนาระบบซอฟต์แวร์ 1 1(0-6-2) 
#     - 942-1107 ภาษาอังกฤษเพื่อการสื่อสาร 2(1-2-3) 
#     - 94x-1107  ภาษาที่สาม 1  1(0-3-1) 
#     - 920-11xx วิชาเลือกกลุ่มวิชามนุษยศาสตร์  2(2-0-4) 
#     - รวม 16(12-14-30)
#     """,
#     metadata={"source": "แผนการศึกษาปี 2 เทอม 1"},
# )
# document_4 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 2 เทอม 2
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 2 ภาคการศึกษาที่ 2 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 300-1211 สถิติคณิตศาสตร์  3(3-0-6) 
#     - 310-2204  การพัฒนาระบบซอฟต์แวร์ 2 2(0-6-2)  
#     - 310-2205  วิศวกรรมซอฟต์แวร์ 3(3-0-6) 
#     - 310-2206 ระบบปฏิบัติการ  3(3-0-6) 
#     - 942-1108 ภาษาอังกฤษเพื่อวิชาชีพ  2(1-2-3) 
#     - 94x-1108 ภาษาที่สาม 2  1(0-3-1) 
#     - 31x-xxx x วิชาชีพเลือก 3(3-0-6) 
#     - รวม 17(13-11-30)
#     """,
#     metadata={"source": "แผนการศึกษาปี 2 เทอม 2"},
# )
# document_5 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 3 เทอม 1
#     # - แผนการศึกษา ของคณะและสาขา ปีที่ 3 ภาคการศึกษาที่ 1 
#     #     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     #     - 310-2307 เครือข่ายคอมพิวเตอร์ 3(3-0-6) 
#     #     - 310-2310 การพัฒนาโปรแกมแบบอะซิโครนัส 3(3-0-6) 
#     #     - 941-1102 ภาษาไทยเพื่อการสื่อสาร  2(1-2-3) 
#     #     - 942-11xx  วิชาเลือกภาษาอังกฤษ  2(2-0-3) 
#     #     - 94x-11xx  ภาษาที่สาม 3  1(0-3-1) 
#     #     - 31x-xxx x วิชาชีพเลือก 3(3-0-6) 
#     #     - 31x-xxx x วิชาชีพเลือก  3(3-0-6) 
#     #     - 31x-xxx x วิชาชีพเลือก 1(0-3-2) 
#     #     - รวม 18(15-8-33)
#     """,
#     metadata={"source": "แผนการศึกษาปี 3 เทอม 1"},
# )
# document_6 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 3 เทอม 2
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 3 ภาคการศึกษาที่ 2 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 310-2308 ปฏิสัมพันธ์ระหว่างคอมพิวเตอร์กับมนุษย์  3(3-0-6) 
#     - 310-2309 ระบบฐานข้อมูล  3(3-0-6) 
#     - 310-2311 การคำนวณแบบกลุ่มเมฆ  3(3-0-6) 
#     - 910-1116 การคิดสร้างสรรค์เพื่อสังคม 3(3-0-6) 
#     - 31x-xxxx วิชาชีพเลือก 3(3-0-6) xxx-xxxx วิชาเลือกเสรี 3(3-0-6) 
#     - รวม 18(18-0-36)
#     """,
#     metadata={"source": "แผนการศึกษาปี 3 เทอม 2"},
# )

# document_7 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 4 เทอม 1
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 4 ภาคการศึกษาที่ 1 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 310-2413 อินเทอร์เน็ตของสรรพสิ่ง  3(3-0-6) 
#     - 310-2414 การเรียนรู้ของเครื่อง 3(3-0-6) 
#     - 310-2416  โครงงานวิศวกรรมคอมพิวเตอร์ 1  1(0-6-6)  
#     - 31x-xxxx วิชาชีพเลือก 3(3-0-6) 
#     - 910-11xx วิชาเลือกกลุ่มวิชาสังคมศาสตร์  3(3-0-6) 
#     - รวม 13(12-6-30)
#     """,
#     metadata={"source": "แผนการศึกษาปี 4 เทอม 1"},
# )

# document_8 = Document(
#     page_content="""
#     ### วิชาที่ต้องเรียนตอนปี 4 เทอม 2
#     - แผนการศึกษา ของคณะและสาขา ปีที่ 4 ภาคการศึกษาที่ 2 
#     - รหัสวิชา ชื่อวิชา  หน่วยกิต (บรรยาย-ปฏิบัติ) 
#     - 300-1412 สัมมนาวิศวกรรมคอมพิวเตอร์ 1(1-2-2) 
#     - 300-1413 จริยธรรมวิชาชีพด้านคอมพิวเตอร์  1(3-0-0) 
#     - 310-2415 ความปลอดภัยของระบบคอมพิวเตอร์และเครือข่าย  3(3-0-6) 
#     - 310-2417 โครงงานวิศวกรรมคอมพิวเตอร์ 2  3(0-6-6) 
#     - 942-11xx วิชาเลือกภาษาอังกฤษ 2(1-2-3) 
#     - xxx-xxxx วิชาเลือกเสรี 3(3-0-6) 
#     - รวม 13(11-10-23)
#     """,
#     metadata={"source": "แผนการศึกษาปี 4 เทอม 2"},
# )

# documents = [document_1, document_2, document_3, document_4, document_5, document_6, document_7, document_8]
# ids_list = ["แผนการศึกษาปี 1 เทอม 1", "แผนการศึกษาปี 1 เทอม 2", 
#             "แผนการศึกษาปี 2 เทอม 1", "แผนการศึกษาปี 2 เทอม 2", 
#             "แผนการศึกษาปี 3 เทอม 1", "แผนการศึกษาปี 3 เทอม 2", 
#             "แผนการศึกษาปี 4 เทอม 1", "แผนการศึกษาปี 4 เทอม 2"]
# contextual_vector.add_documents(documents=documents, ids=ids_list)


# document_8 = Document(
#     page_content="""
#     การได้รับปริญญาเกียรตินิยม
#     1) มีระยะเวลาการศึกษาไม่เกินที่กำหนดไว้ตามแผนการศึกษาของหลักสูตร 
#     2) ไม่เคยได้รับค่าระดับคะแนน F หรือ U ในรายวิชาใด
#     3) ไม่เคยเรียนซ้ำในรายวิชาใด
#     4) ได้ค่าระดับคะแนนเฉลี่ยสะสมตั้งแต่ 3.25 ขึ้นไป
#     โดยผู้ที่ได้ค่าระดับคะแนนเฉลี่ยสะสมตั้งแต่ `3.25 ถึง 3.75 ให้ได้เกียรตินิยมอันดับสอง` และ`ผู้ที่ได้ค่าระดับคะแนนเฉลี่ยสะสมตั้งแต่ 3.75 `ขึ้นไปให้ได้เกียรตินิยมอันดับหนึ่ง
#     """,
#     metadata={"source": "เงื่อนไขการรับเกียรตินิยม"},
# )

# contextual_vector.add_documents(documents=[document_8], ids=["เงื่อนไขการรับเกียรตินิยม"])